// Для решения всех этих задач используйте методы массивов https://learn.javascript.info/array-methods

// 1. Даны два массива: [1, 2, 3] и [4, 5, 6]. Объедините их вместе.
    const a1 = [1, 2, 3]
    const b1 = [4, 5, 6]
    const c1 = [...a1, ...b1]
    const d1 = a1.concat(b1)
    console.log("task1",c1)
    console.log("task1",d1)
// 2. Дан массив [1, 2, 3]. Сделайте из него массив [3, 2, 1].
    const a2 = [1, 2, 3]
    const b2 = a2.reverse()
    console.log("task2",b2)
// 3. Дан массив [1, 2, 3]. Добавьте ему в конец элементы 4, 5, 6.
    const a3 = [1, 2, 3]
    a3.push(4, 5, 6)
    console.log("task3",a3)
// 4. Дан массив [1, 2, 3]. Добавьте ему в начало элементы 4, 5, 6.
    const a4 = [1, 2, 3]
    a4.unshift(4, 5, 6)
    console.log("task4",a4)
// 5. Дан массив ['js', 'css', 'jq']. Выведите на экран первый элемент.
    const a5 = ['js', 'css', 'jq']
    const firstElement= a5[0]
    console.log("task5",firstElement)
// 6. Дан массив ['js', 'css', 'jq']. Выведите на экран последний элемент.
    const a6 = ['js', 'css', 'jq']
    const lastElement= a6[a6.length-1]
    console.log("task6",lastElement)
// 7. Дан массив [1, 2, 3, 4, 5]. С помощью метода запишите в новый массив элементы [1, 2, 3].
    const a7 = [1, 2, 3, 4, 5]
    console.log("task7",a7.slice(0,3))
// 8. Дан массив [1, 2, 3, 4, 5]. С помощью метода запишите в новый массив элементы [4, 5].
    const a8 = [1, 2, 3, 4, 5]
     a8.slice(3,5)
    console.log("task8",a8)
// 9. Дан массив [1, 2, 3, 4, 5]. С помощью метода преобразуйте массив в [1, 4, 5].
    const a9 = [1, 2, 3, 4, 5]
     a9.splice(1,2)
     console.log("task9",a9)
// 10. Дан массив [1, 2, 3, 4, 5]. С помощью метода запишите в новый массив элементы [2, 3, 4].
    const a10 = [1, 2, 3, 4, 5]
    a10.shift()
    a10.pop()
    console.log("task10",a10)
// 11. Дан массив [1, 2, 3, 4, 5]. С помощью метода сделайте из него массив [1, 2, 3, 'a', 'b', 'c', 4, 5].
    const a11 = [1, 2, 3, 4, 5]
    a11.splice(3,0,'a','b','c')
    console.log("task11",a11)
// 12. Дан массив [1, 2, 3, 4, 5]. С помощью метода сделайте из него массив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
    const a12 = [1, 2, 3, 4, 5]
   a12.splice(1, 0, 'a', 'b');
   a12.splice(6, 0, 'c');
   a12.splice(8, 0, 'e');
    console.log("task12",a12)
// 13. Дан массив [3, 4, 1, 2, 7]. Отсортируйте его.
    const a13 = [3, 4, 1, 2, 7]
    a13.sort()
    console.log("task13",a13)
    a13.sort((a, b) => b - a);
    console.log("task13",a13)
// 14. Дан массив с числами [5, 6, 7, 8, 9]. Найдите сумму этих чисел.
    const a14 = [5, 6, 7, 8, 9]
    const sum = a14.reduce((acc,el)=>acc+el,0)
    console.log("task14",sum)
// 15. Дан массив с числами [5, 6, 7, 8, 9]. Сделайте из него массив, состоящий из квадратов этих чисел.
    const a15 = [5, 6, 7, 8, 9]
    const b15 = a15.map(el=>el*el)
    console.log("task15",b15)
// 16. Дан массив с числами [1,-3, 5, 6,-7, 8, 9,-11]. Оставьте в нем только отрицательные числа.
    const a16 = [1,-3, 5, 6,-7, 8, 9,-11]
    const b16 = a16.filter(el=>el<0)
    console.log("task16",b16)
// 17. Дан массив с числами [1,-3, 5, 6,-7, 8, 9,-11]. Оставьте в нем только четные числа.
    const a17 = [1,-3, 5, 6,-7, 8, 9,-11]
    const b17 = a17.filter(el=>el%2===0)
    console.log("task17",b17)
// 18. Дан массив со строками ['aaa', 'aaaqqq', 'zzzqq', 'zz', 'qsaa', 'q', 'az']. Оставьте в нем только те строки, длина которых больше 5-ти символов.
    const a18 =  ['aaa', 'aaaqqq', 'zzzqq', 'zz', 'qsaa', 'q', 'az']
    const b18 = a18.filter(el=>el.length>5)
    console.log("task18",b18)
// 19. Дан массив, в нем могут быть обычные элементы и подмассивы, например [1, 2, [3, 4], 5, [6, 7]]. Оставьте в нем только подмассивы.
    const a19 =   [1, 2, [3, 4], 5, [6, 7]]
    const b19 = a19.filter(el=>Array.isArray(el))
    console.log("task19",b19)
// 20. Дан массив с числами [5,-3, 6,-5, 0,-7, 8, 9]. Посчитайте количество отрицательных чисел в этом массиве.
    const a20 =   [5,-3, 6,-5, 0,-7, 8, 9]
    const b20 = a20.filter(el=>el<0).length
 console.log("task20",b20)